Revit 2027 API
AppearanceAssetEditScope Constructor
 Constructs a new instance of an AppearanceAssetEditScope.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AppearanceAssetEditScope(
	Document document
)
Public Sub New (
	document As Document
)
public:
AppearanceAssetEditScope(
	Document^ document
)
new :
        document : Document -> AppearanceAssetEditScope
Parameters
document Document
 The document for which this EditScope is going to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace